tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "argocd"
brew "bat"
brew "emacs"
brew "cask"
brew "cmake"
brew "expect"
brew "fzf"
brew "go"
brew "golang-migrate"
brew "helm"
brew "hugo"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "lsd"
brew "node"
brew "oath-toolkit"
brew "openjdk@11"
brew "openjdk@17"
brew "pandoc"
brew "pandoc-crossref"
brew "pkgconf"
brew "ripgrep"
brew "rust"
brew "starship"
brew "thefuck"
brew "typst"
brew "uv"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "aerospace"
cask "appcleaner"
cask "claude"
cask "cursor"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "insomnia"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "keycastr"
cask "mactex"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "slack"
cask "spotify"
cask "utm"
cask "visual-studio-code@insiders"
cask "warp"
cask "zen-browser"
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
