tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "supabase/tap"
brew "bat"
brew "cask"
brew "cloudflared"
brew "ffmpeg"
brew "git"
brew "lsd"
brew "mise"
brew "pandoc"
brew "pandoc-crossref"
brew "typst"
brew "uv"
brew "yarn"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "supabase/tap/supabase"
cask "aerospace"
cask "appcleaner"
cask "arc"
cask "claude"
cask "cloudflare-warp"
cask "cyberduck"
cask "discord"
cask "fliqlo"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "google-drive"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "linearmouse"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "notion"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "postman"
cask "raycast"
cask "setapp"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "windsurf"
cask "wireshark-app"
cask "zen"
cask "zoom"